{
  "_name_or_path": "distilbert_model",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "expense_loan",
    "1": "income_salary",
    "2": "expense_food",
    "3": "expense_bills",
    "4": "investment_mutual_funds",
    "5": "investment_fd_interest",
    "6": "expense_shopping",
    "7": "expense_transport",
    "8": "expense_insurance",
    "9": "investment_stocks",
    "10": "expense_others",
    "11": "income_others",
    "12": "investment_others",
    "13": "investment_fd_booking",
    "14": "expense_health"
  },
  "initializer_range": 0.02,
  "label2id": {
    "expense_bills": 3,
    "expense_food": 2,
    "expense_health": 14,
    "expense_insurance": 8,
    "expense_loan": 0,
    "expense_others": 10,
    "expense_shopping": 6,
    "expense_transport": 7,
    "income_others": 11,
    "income_salary": 1,
    "investment_fd_booking": 13,
    "investment_fd_interest": 5,
    "investment_mutual_funds": 4,
    "investment_others": 12,
    "investment_stocks": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vocab_size": 30522
}
