{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "investment_fd_interest",
    "1": "investment_fd_booking",
    "2": "investment_mutual_fund",
    "3": "expense_food",
    "4": "expense_shopping",
    "5": "income_salary",
    "6": "income_bonus",
    "7": "expense_bills"
  },
  "initializer_range": 0.02,
  "label2id": {
    "expense_bills": 7,
    "expense_food": 3,
    "expense_shopping": 4,
    "income_bonus": 6,
    "income_salary": 5,
    "investment_fd_booking": 1,
    "investment_fd_interest": 0,
    "investment_mutual_fund": 2
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "use_cache": false,
  "vocab_size": 30522
}
